// Создаем список из клонов валидных mines
// Из closedPoints исключаем элементы на которые есть указатели в списке
// Для всех оставшихся вызвываем open

public class Main {
    public static void main(String[] args) {
//        String b =  "? ? ? ? ? ?\n? ? ? ? ? ?\n? ? ? 0 ? ?\n? ? ? ? ? ?\n? ? ? ? ? ?\n0 0 0 ? ? ?";
        String b = """
                0 ? ?
                0 ? ?
                """;
        int n = 13;

//        System.out.println(b);
//        System.out.println("-------------------");

        MineSweeper ms = new MineSweeper(b, n);
        System.out.println("***  Result ***");
        System.out.println(ms.solve());
    }
}

// "0 2 ?\n0 2 ?";

// "? ? ? ? ? ?\n? ? ? ? ? ?\n? ? ? 0 ? ?\n? ? ? ? ? ?\n? ? ? ? ? ?\n0 0 0 ? ? ?"
// n = 6
//  1 x 1 1 x 1
//  2 2 2 1 2 2
//  2 x 2 0 1 x
//  2 x 2 1 2 2
//  1 1 1 1 x 1
//  0 0 0 1 1 1

//        ? ? 0 0 0 0
//        ? ? 0 0 0 0
//        ? ? 0 0 0 0
//        0 0 0 0 0 0
//        ? ? ? ? 0 0
//        ? ? ? ? 0 0
//        ? ? ? ? ? ?
//        ? ? ? 0 ? ?
//        ? ? ? ? ? ?
//        ? ? ? ? ? 0
//        ? ? ? ? ? 0
//        ? ? ? ? 0 0
//        0 ? ? ? 0 0
//        0 ? ? ? 0 0
//        0 0 0 0 0 0
//        0 ? ? ? 0 0
//        ? ? ? ? 0 0
//        ? ? ? ? 0 0
//        ? ? ? ? 0 0
//        ? ? ? ? 0 0
//        ? ? ? ? 0 0
//        ? ? ? 0 0 0
//
//
//        Failed test!!
//
//        Expected:
//        1 1 0 0 0 0
//        x 1 0 0 0 0
//        1 1 0 0 0 0
//        0 0 0 0 0 0
//        1 2 1 1 0 0
//        x 2 x 1 0 0
//        1 2 1 1 1 1
//        2 2 1 0 1 x
//        x x 2 1 2 1
//        3 3 3 x 1 0
//        1 x 2 1 1 0
//        1 2 2 1 0 0
//        0 1 x 1 0 0
//        0 1 1 1 0 0
//        0 0 0 0 0 0
//        0 1 1 1 0 0
//        1 2 x 1 0 0
//        1 x 2 1 0 0
//        1 2 2 1 0 0
//        1 2 x 1 0 0
//        1 x 2 1 0 0
//        1 1 1 0 0 0
//
//        But was:
//        ?

